app/Http/Controllers/FrontEnd/FrontendController.php

select `id`, `name`, `status` from `districts` where `status` = 1
---
    private function districts()
    {
        return District::select('id', 'name', 'status')->where('status', 1)->get();

select * from `service_types` where `status` = 1
---
    private function servicetypes()
    {
        return  ServiceType::where('status', 1)->get();

select * from `banners` where (`status` = 1)
select * from `services` where (`status` = 1 and `type` = 1)
select * from `pricings` where (`status` = 1 and `type` = 1)
select * from `whychooseuses` where (`status` = 1) limit 1
select * from `clients` where (`status` = 1)
select * from `faqs` where (`status` = 1)
---
    public function index()
    {
        $sliders = Banner::where(['status' => 1])->get();
        $regular_services = Service::where(['status' => 1, 'type' => 1])->get();
        $advance_services = Service::where(['status' => 1, 'type' => 2])->get();
        $within_dhaka = Pricing::where(['status' => 1, 'type' => 1])->get();
        $advance_delivery = Pricing::where(['status' => 1, 'type' => 2])->get();
        $suburb_delivery = Pricing::where(['status' => 1, 'type' => 3])->get();
        $weight_charge = Pricing::where(['status' => 1, 'type' => 4])->get();
        $whychooseus = Whychooseus::where(['status' => 1])->get();
        $clients = Client::where(['status' => 1])->get();
        $faqs = Faq::where(['status' => 1])->get();

select * from `parcel_notes` where `parcel_id` = '' order by `created_at` desc
select * from `parcels` where `parcel_id` is null limit 1
---
    public function track(Request $request)
    {
        $parcel = Parcel::where('parcel_id', $request->parcel_id)->with('parcelstatus')->first();
        $notes  = ParcelNote::where('parcel_id', $parcel ? $parcel->id : '')->latest()->get();

select * from `districts` where `status` = 1
---
    public function coverage(Request $request)
    {
        $coverages = District::where('status', 1)->with('areas');
        if ($request->keyword) {
            $coverages = $coverages->where('name', 'LIKE', '%' . $request->keyword . '%')
                ->orWhereHas('areas', function ($query) use ($request) {
                    $query->where('area_name', 'LIKE', '%' . $request->keyword . '%');
                });
        }
        $coverages = $coverages->get();

select * from `abouts` where `status` = 1 limit 1
select * from `mission_vissions` where (`status` = 1 and `category` = 1) limit 1
select * from `counters` where (`status` = 1) limit 4
select * from `client_feedback` where (`status` = 1) limit 10
---
    public function about_us(Request $request)
    {
        $about      = About::where('status', 1)->limit(1)->get();
        $mission    = MissionVission::where(['status' => 1, 'category' => 1])->limit(1)->get();
        $vission    = MissionVission::where(['status' => 1, 'category' => 2])->limit(1)->get();
        $counters   = Counter::where(['status' => 1])->limit(4)->get();
        $feedbacks  = ClientFeedback::where(['status' => 1])->limit(10)->get();

select * from `create_pages` where (`slug` = 'terms-and-conditions' and `status` = 1) limit 1
---
    public function page($slug)
    {
        $details = Createpage::where(['slug' => $slug, 'status' => 1])
            ->firstOrFail();