app/Http/Controllers/FrontEnd/MerchantController.php

select `name` from `general_settings` limit 1
---
    private function setting()
    {
        return GeneralSetting::select('name')->first();

insert into `merchants` (`shop_id`, `shop_name`, `name`, `email`, `phone`, `agree`, `status`, `verify`, `password`, `updated_at`, `created_at`) values ('1000014', 'FkvdEEQEKghgK', 'KfCHlFAwMJFXnlf', 'wijiofvqwxph@yahoo.com', '6228712474', '1', 0, 5591, '$2y$10$KY6pN.cqyLX.X1wlzKYxw.7ZzH2pXP7mczc4orRpyBQVqm9DgsxHK', '2024-11-10 06:23:07', '2024-11-10 06:23:07')
---
    public function store(Request $request)
    {
        $this->validate($request, [
            'shop_name' => 'required',
            'name' => 'required',
            'phone' => 'required|unique:merchants',
            'email' => 'required|unique:merchants',
            'password' => 'required',
            'agree' => 'required',
            'confirmed' => 'required_with::password|same:password',
        ]);
        $verify = rand(1111, 9999);
        $store_data = new Merchant();
        $store_data->shop_id = $this->generateShopId();
        $store_data->shop_name = $request->shop_name;
        $store_data->name = $request->name;
        $store_data->email = $request->email;
        $store_data->phone = $request->phone;
        $store_data->agree = $request->agree;
        $store_data->status = 0;
        $store_data->verify = $verify;
        $store_data->password = bcrypt($request->password);
        $store_data->save();

select `id`, `phone`, `email`, `name`, `password`, `verify`, `status`, `twofa` from `merchants` where `phone` = 'wijiofvqwxph@yahoo.com' or `email` = 'wijiofvqwxph@yahoo.com' limit 1
---
    public function signin(Request $request)
    {
        $this->validate($request, [
            'email_phone' => 'required',
            'password' => 'required',
        ]);
        $auth_check = Merchant::select('id','phone','email', 'name', 'password', 'verify', 'status','twofa')->where('phone', $request->email_phone)->orWhere('email', $request->email_phone)->first();

select * from `merchants` order by `id` desc limit 1
---
    public function generateShopId(){
        $lastMember = Merchant::orderBy('id', 'desc')->first();