app/Http/Controllers/FrontEnd/RiderController.php

select `name` from `general_settings` limit 1
---
    private function setting()
    {
        return GeneralSetting::select('name')->first();

insert into `riders` (`rider_id`, `name`, `email`, `phone`, `agree`, `status`, `verify`, `password`, `updated_at`, `created_at`) values ('100009', 'rWJPRQuWlwDQj', 'wijiofvqwxph@yahoo.com', '3678957841', '1', 0, 6096, '$2y$10$gvYctSLVUJrPbTpAf170SeTZUApV385f6SClHrXJ/RTAAr5KsQeKG', '2024-11-10 06:23:26', '2024-11-10 06:23:26')
---
    public function store(Request $request)
    {
        $this->validate($request, [
            'name' => 'required',
            'phone' => 'required|unique:riders',
            'email' => 'required|unique:riders',
            'password' => 'required',
            'agree' => 'required',
            'confirmed' => 'required_with::password|same:password',
        ]);
        $verify                 = rand(1111, 9999);
        $store_data             = new Rider();
        $store_data->rider_id   = $this->generateRiderId();
        $store_data->name       = $request->name;
        $store_data->email      = $request->email;
        $store_data->phone      = $request->phone;
        $store_data->agree      = $request->agree;
        $store_data->status     = 0;
        $store_data->verify     = $verify;
        $store_data->password = bcrypt($request->password);
        $store_data->save();

select count(*) as aggregate from `parcels` where `rider_id` = 1
select count(*) as aggregate from `parcels` where `rider_id` = 1 and `status` = '7'
select count(*) as aggregate from `parcels` where `rider_id` = 1 and `status` not in ('1', '7', '8', '9', '10')
select count(*) as aggregate from `parcels` where `rider_id` = 1 and `status` = '9'
select sum(`cod`) as aggregate from `parcels` where `rider_id` = 1
select sum(`cod`) as aggregate from `parcels` where `rider_id` = 1 and `status` = '7'
select sum(`cod`) as aggregate from `parcels` where `rider_id` = 1 and `status` not in ('1', '7', '8', '9', '10')
select sum(`cod`) as aggregate from `parcels` where `rider_id` = 1 and `status` = '9'
---
    public function dashboard(Request $request){

        if ($request->start_date && $request->end_date) {
            $total_order = Parcel::where('rider_id', Auth::guard('rider')->user()->id)->whereBetween('created_at', [$request->start_date,$request->end_date])->count();
            $total_delivery = Parcel::where('rider_id', Auth::guard('rider')->user()->id)->where('status','7')->whereBetween('created_at', [$request->start_date,$request->end_date])->count();
            $total_process = Parcel::where('rider_id', Auth::guard('rider')->user()->id)->whereNotIn('status',['1','8','9','10'])->whereBetween('created_at', [$request->start_date,$request->end_date])->count();
            $total_return = Parcel::where('rider_id', Auth::guard('rider')->user()->id)->where('status','9')->whereBetween('created_at', [$request->start_date,$request->end_date])->count();
            $total_amount = Parcel::where('rider_id', Auth::guard('rider')->user()->id)->whereBetween('created_at', [$request->start_date,$request->end_date])->sum('cod');
            $delivery_amount = Parcel::where('rider_id', Auth::guard('rider')->user()->id)->where('status','7')->whereBetween('created_at', [$request->start_date,$request->end_date])->sum('cod');
            $process_amount = Parcel::where('rider_id', Auth::guard('rider')->user()->id)->whereNotIn('status',['1','7','8','9','10'])->whereBetween('created_at', [$request->start_date,$request->end_date])->sum('cod');
            $return_amount = Parcel::where('rider_id', Auth::guard('rider')->user()->id)->where('status','9')->whereBetween('created_at', [$request->start_date,$request->end_date])->sum('cod');
        }else{
            $total_order = Parcel::where('rider_id', Auth::guard('rider')->user()->id)->count();
            $total_delivery = Parcel::where('rider_id', Auth::guard('rider')->user()->id)->where('status','7')->count();
            $total_process = Parcel::where('rider_id', Auth::guard('rider')->user()->id)->whereNotIn('status',['1','7','8','9','10'])->count();
            $total_return = Parcel::where('rider_id', Auth::guard('rider')->user()->id)->where('status','9')->count();
            $total_complete = Parcel::where('rider_id', Auth::guard('rider')->user()->id)->where('status','7')->count();
            $total_amount = Parcel::where('rider_id', Auth::guard('rider')->user()->id)->sum('cod');
            $delivery_amount = Parcel::where('rider_id', Auth::guard('rider')->user()->id)->where('status','7')->sum('cod');
            $process_amount = Parcel::where('rider_id', Auth::guard('rider')->user()->id)->whereNotIn('status',['1','7','8','9','10'])->sum('cod');
            $return_amount = Parcel::where('rider_id', Auth::guard('rider')->user()->id)->where('status','9')->sum('cod');

select * from `parcel_statuses` where `slug` = 'pending' limit 1
select count(*) as aggregate from `parcels` where (`rider_id` = 1) and `status` = 1
---
    public function index($slug){

       $parclstatus = ParcelStatus::where('slug',$slug)->first();
       $parcels = Parcel::where(['rider_id'=>Auth::guard('rider')->user()->id])->select('id','name','phone','address','cod','delivery_charge','cod_charge','district_id','area_id','parcel_id','merchant_invoice','status','payment_status')->with('parcelstatus');
       if($slug == 'all'){
            $type = 'All';
        }else{
            $parcels = $parcels->where('status',$parclstatus->id);
            $type = $parclstatus->name;
        }
        $parcels = $parcels->latest()->paginate(25);

select * from `riders` order by `id` desc limit 1
---
    public function generateRiderId(){
        $lastMember = Rider::orderBy('id', 'desc')->first();